import Section from "../common/styles/Section.styled";
import Image from "next/image";
import { useRouter } from "next/router";
import service from "../../../public/home-service2.jpg";
import * as Styled from "./styles/Services.styled";

export default function ServicesDiagnostic() {
  const { locale } = useRouter();
  return (
    <Section>
      <Styled.ServicesContainer>
        <Image
          src={service}
          alt={
            locale === "ua"
              ? "Діагностика телевізорів в Києві"
              : "Диагностика телевизоров в Киеве"
          }
        />
        <Styled.TextBlock position="right">
          <h2>{locale === "ua" ? "Діагностика" : "Диагностика"}</h2>
          <div>
            <p>
              {locale === "ua"
                ? "Будь-яка діагностика телевізорів містить у собі три основні критерії, без яких подальший ремонт не можливий:"
                : "Любая диагностика телевизоров включает в себя три основных критерия, без которых дальнейший ремонт невозможен:"}
            </p>
            <ul>
              <li>
                <p>
                  {locale === "ua"
                    ? "візуальний огляд телевізора;"
                    : "визуальный обзор телевизора;"}
                </p>
              </li>
              <li>
                <p>
                  {locale === "ua"
                    ? "виконання апаратного очищення;"
                    : "выполнение аппаратной очистки;"}
                </p>
              </li>
              <li>
                <p>
                  {locale === "ua"
                    ? "наявність сучасного діагностичного устаткування."
                    : "наличие современного диагностического оборудования."}
                </p>
              </li>
            </ul>
            <p>
              {locale === "ua"
                ? "Такий комплексний підхід дає можливість максимально точно виявити причину несправності. Тільки після того, як буде проведена діагностика телевізора ціна на яку при ремонті враховується, фахівець зможе визначити, які саме компоненти вийшли з ладу, чи підлягають вони відновленню, чи їх заміна. Це максимально важливо, оскільки саме від цих нюансів залежатиме вартість кінцевого ремонту."
                : "Такой комплексный подход позволяет максимально точно выявить причину неисправности. Только после того, как будет проведена диагностика телевизора, цена на которую при ремонте учитывается, специалист сможет определить, какие именно компоненты вышли из строя, подлежат ли они восстановлению или их замена. Это максимально важно, поскольку именно от этих нюансов будет зависеть стоимость окончательного ремонта."}
            </p>
          </div>
        </Styled.TextBlock>
      </Styled.ServicesContainer>
    </Section>
  );
}
