import { useRouter } from "next/router";
import Section from "../common/styles/Section.styled";
import service from "../../../public/home-service3.jpg";
import * as Styled from "./styles/Services.styled";

export default function ServicesSetting() {
  const { locale } = useRouter();
  return (
    <Section>
      <Styled.ServicesContainer>
        <div>
          <img src={service.src} />
        </div>
        <Styled.TextBlock position="left">
          <h2>{locale === "ua" ? "Налаштування" : "Настройка"}</h2>
          <p>
            {locale === "ua"
              ? "Нашими майстрами проводиться налаштування цифрових та звичайних телевізійних програм на всіх моделях телевізорів імпортного та вітчизняного виробництва, як на сучасній апаратурі, так і на старій, випущеній у XX столітті."
              : "Нашими мастерами производятся настройки цифровых и обычных телевизионных программ на всех моделях телевизоров импортного и отечественного производства, как на современной аппаратуре, так и на старой, выпущенной в XX веке."}
          </p>
          <p>
            {locale === "ua"
              ? "Досвідчені фахівці знають, як налаштувати телевізійні канали, як виставити якісне зображення та звук, як налаштувати інтернет на телевізорі, під'єднати його до антени чи через приставку. Пропонуємо викликати майстра налаштувати телевізор із нашої майстерні."
              : "Опытные специалисты знают, как настроить телевизионные каналы, как выставить качественное изображение и звук, как настроить интернет на телевизоре, подключить его к антенне или через приставку. Предлагаем вызвать мастера настроить телевизор из нашей мастерской."}
          </p>
        </Styled.TextBlock>
      </Styled.ServicesContainer>
    </Section>
  );
}
