import { useRouter } from "next/router";
import Section from "../common/styles/Section.styled";
import service from "../../../public/home-service1.jpg";
import * as Styled from "./styles/Services.styled";

export default function ServicesRepair() {
  const { locale } = useRouter();
  return (
    <Section>
      <Styled.ServicesContainer>
        <div>
          <img src={service.src} />
        </div>
        <Styled.TextBlock position="left">
          <h2>Ремонт</h2>
          <p>
            {locale === "ua"
              ? "Виконуємо ремонт всіх типів телевізорів – кінескопні, рідкокристалічні (LED, LCD), плазмові. Головним фактором, який впливає на вартість ремонту телевізора, є характер поломки, складність роботи, що виконується і, звичайно ж, термін виконання роботи. Ми можемо запропонувати вам якісний ремонт телевізорів усіх брендових та моделей. Визначити точнішу ціну ремонтних робіт наш майстер зможе після проведення діагностики. Хоча в деяких випадках вартість ремонту можна визначити ще по телефону."
              : "Выполняем ремонт всех типов телевизоров – кинескопные, жидкокристаллические (LED, LCD), плазменные. Главным фактором, который влияет на стоимость ремонта телевизора, является характер поломки, выполняемая сложность работы и, конечно же, срок выполнения работы. Мы можем предложить качественный ремонт телевизоров всех брендовых и моделей. Определить более точную цену ремонтных работ наш мастер сможет после проведения диагностики. Хотя в некоторых случаях стоимость ремонта можно определить по телефону."}
          </p>
        </Styled.TextBlock>
      </Styled.ServicesContainer>
    </Section>
  );
}
