import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import Head from "next/head";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";

export default function Bravis() {
  const { locale } = useRouter();
  return (
    <>
      <Head>
        <title>
          {locale === "ua"
            ? "Ремонт телевізорів Bravis"
            : "Ремонт телевизоров Bravis"}
        </title>
        <meta
          name="description"
          key="desc"
          content={
            locale === "ua"
              ? "Ремонт телевізорів Bravis у Києві"
              : "Ремонт телевізорів Bravis в Киеве"
          }
        />
      </Head>
      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <div>
              <h1>
                Ремонт телевизоров Bravis: профессиональное восстановление
                качества вашего оборудования
              </h1>
              <Styled.AfterTitle>
                Телевизоры Bravis известны своим качеством изображения и звука,
                а также инновационными возможностями. Однако даже лучшая техника
                может столкнуться с поломками и неисправностями. Если ваш
                телевизор Bravis требует ремонта, наша компания готова
                предоставить профессиональные услуги восстановления.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему выбирать нас для ремонта телевизоров Bravis?
              </Styled.SubTitle>
              <ol>
                <li>
                  Экспертное знание техники Bravis: Наша команда имеет
                  многолетний опыт ремонта телевизоров Bravis. Мы знакомы с
                  особенностями этой техники и способны быстро выявлять и
                  устранять проблемы.
                </li>
                <li>
                  Квалифицированные техники: Наши специалисты прошли специальное
                  обучение в области ремонта телевизоров Bravis. Они умеют
                  эффективно диагностировать и устранять неисправности.
                </li>
                <li>
                  Использование оригинальных запчастей: Мы используем только
                  оригинальные запчасти Bravis для замены поврежденных
                  компонентов, что гарантирует качество и надежность ремонта.
                </li>
                <li>
                  Быстрая и надежная работа: Мы понимаем, насколько важно быстро
                  восстановить работу телевизора. Наша команда работает
                  оперативно, чтобы минимизировать время без оборудования.
                </li>
              </ol>
              <Styled.SubTitle>
                Виды неисправностей, которые мы устраняем:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблемы с изображением: Имеются проблемы с качеством
                  изображения или его отсутствие? Мы готовы восстановить
                  качество воспроизведения.
                </li>
                <li>
                  Проблемы со звуком: Если у вас возникли проблемы с звуком,
                  такие как шумы или отсутствие звука, наши специалисты помогут
                  вам устранить их.
                </li>
                <li>
                  Портовые и подключения: Мы готовы решить проблемы с
                  подключением, включая HDMI, USB и другие порты.
                </li>
              </ol>
              <Styled.SubTitle>
                Процесс ремонта телевизоров Bravis:
              </Styled.SubTitle>
              <ol>
                <li>
                  Диагностика: Наши техники подробно анализируют ваш телевизор
                  Bravis, чтобы выявить источник неисправности.
                </li>
                <li>
                  Оценка стоимости: После диагностики мы предоставим вам точную
                  оценку стоимости ремонта.
                </li>
                <li>
                  Профессиональный ремонт: После вашего согласия мы начнем
                  ремонт, используя только оригинальные компоненты.
                </li>
                <li>
                  Тестирование и гарантия: После завершения ремонтных работ мы
                  тщательно проверим ваш телевизор, чтобы обеспечить его
                  оптимальную работу, и предоставим гарантию на нашу работу
                </li>
              </ol>
              <Styled.SubTitle>Обращайтесь к нам:</Styled.SubTitle>
              <p>
                Если ваш телевизор Bravis требует ремонта, не стесняйтесь
                обращаться к нам. Наша команда экспертов готова восстановить
                качество вашего оборудования. Обратитесь к нам прямо сейчас и
                верните свой телевизор Bravis в рабочее состояние!
              </p>
            </div>
          ) : (
            <div>
              <h1>
                Ремонт телевізорів Bravis: професійне відновлення якості вашого
                обладнання
              </h1>
              <Styled.AfterTitle>
                Телевізори Bravis відомі своєю якістю зображення та звуку, а
                також інноваційними можливостями. Однак, навіть найкраща техніка
                може зазнавати поломок та виникати неполадки. Якщо ваш телевізор
                Bravis потребує ремонту, наша компанія готова надати професійні
                послуги відновлення.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому обирати нас для ремонту телевізорів Bravis?
              </Styled.SubTitle>
              <ol>
                <li>
                  Експертні знання в галузі техніки Bravis: Наша команда має
                  багаторічний досвід ремонту телевізорів Bravis. Ми знайомі з
                  особливостями цієї техніки та можемо швидко виявити та усунути
                  проблеми.
                </li>
                <li>
                  Кваліфіковані техніки: Наші фахівці пройшли спеціальне
                  навчання у сфері ремонту телевізорів Bravis. Вони вміють
                  ефективно діагностувати та усувати неполадки.
                </li>
                <li>
                  Використання оригінальних запчастин: Ми використовуємо лише
                  оригінальні запчастини Bravis для заміни пошкоджених
                  компонентів, що гарантує якість та надійність ремонту.
                </li>
                <li>
                  Швидка та надійна робота: Ми розуміємо, наскільки важливо
                  швидко відновити роботу телевізора. Наша команда працює
                  оперативно, щоб мінімізувати час без обладнання.
                </li>
              </ol>
              <Styled.SubTitle>
                Різновиди неполадок, які ми усуваємо:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблеми з зображенням: Чи є у вас проблеми з якістю
                  зображення або його відсутність? Ми готові відновити якість
                  відтворення.
                </li>
                <li>
                  Проблеми зі звуком: Якщо ви стикаєтеся з проблемами із звуком,
                  такими як шуми або відсутність звуку, наші фахівці допоможуть
                  вам усунути їх.
                </li>
                <li>
                  Порти та підключення: Ми готові вирішити проблеми з
                  підключенням, включаючи HDMI, USB та інші порти.
                </li>
              </ol>
              <Styled.SubTitle>
                Процес ремонту телевізорів Bravis:
              </Styled.SubTitle>
              <ol>
                <li>
                  Діагностика: Наші техніки докладно аналізують ваш телевізор
                  Bravis, щоб визначити джерело несправності.
                </li>
                <li>
                  Оцінка вартості: Після діагностики ми надамо вам точну оцінку
                  вартості ремонту.
                </li>
                <li>
                  Професійний ремонт: Після вашої згоди ми розпочнемо ремонт,
                  використовуючи лише оригінальні запчастини.
                </li>
                <li>
                  Тестування та гарантія: Після завершення ремонтних робіт ми
                  ретельно перевіримо ваш телевізор, щоб забезпечити його
                  оптимальну роботу, і надамо гарантію на нашу роботу.
                </li>
              </ol>
              <Styled.SubTitle>Звертайтеся до нас:</Styled.SubTitle>
              <p>
                Якщо ваш телевізор Bravis потребує ремонту, не вагайтеся
                звертатися до нас. Наша команда експертів готова відновити
                якість вашого обладнання. Зверніться до нас прямо зараз і
                поверніть свій телевізор Bravis до робочого стану!
              </p>
            </div>
          )}
        </Container>
      </Section>
    </>
  );
}
