import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import Head from "next/head";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";

export default function Grunding() {
  const { locale } = useRouter();
  return (
    <>
      <Head>
        <title>
          {locale === "ua"
            ? "Ремонт телевізорів Grunding"
            : "Ремонт телевизоров Grunding"}
        </title>
        <meta
          name="description"
          key="desc"
          content={
            locale === "ua"
              ? "Ремонт телевізорів Grunding у Києві"
              : "Ремонт телевізорів Grunding в Киеве"
          }
        />
      </Head>
      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <Styled.Page>
              <h1>
                Ремонт телевизоров Grundig: качественное восстановление вашего
                телевизионного опыта
              </h1>
              <Styled.AfterTitle>
                Телевизоры Grundig - это не только источник информации и
                развлечений, но и важный элемент вашего домашнего комфорта.
                Однако иногда даже надежные технические решения могут
                столкнуться с поломкой. Если ваш телевизор Grundig требует
                ремонта, наша компания готова предоставить вам профессиональные
                услуги для восстановления качества изображения и звука.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему выбирать нас для ремонта телевизоров Grundig?
              </Styled.SubTitle>
              <ol>
                <li>
                  Экспертные знания: Наша команда специалистов обладает
                  глубокими знаниями в области ремонта и обслуживания
                  телевизоров Grundig. Мы понимаем все тонкости этой техники и
                  умеем решать разнообразные проблемы.
                </li>
                <li>
                  Квалифицированные мастера: Наши специалисты проходят
                  обязательное обучение и имеют многолетний опыт работы с
                  телевизорами Grundig. Они знают, как эффективно выявлять и
                  устранять неисправности.
                </li>
                <li>
                  Использование оригинальных деталей: Мы используем только
                  оригинальные запчасти во время ремонта, чтобы обеспечить
                  высочайшее качество восстановления вашего телевизора.
                </li>
                <li>
                  Быстрая реакция: Понимая важность работы телевизора, мы
                  стараемся выполнить ремонт как можно скорее, чтобы вы снова
                  могли наслаждаться просмотром ваших любимых программ.
                </li>
              </ol>
              <Styled.SubTitle>
                Распространенные проблемы, которые мы решаем:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблемы с изображением: Если ваш телевизор Grundig имеет
                  размытое изображение, странные полосы или другие артефакты, мы
                  поможем вам восстановить четкость и качество картинки.
                </li>
                <li>
                  Проблемы со звуком: Не слышите звука или качество звука
                  ухудшилось? Наши мастера найдут коренную причину и восстановят
                  звуковой поток.
                </li>
                <li>
                  Проблемы с подключением: Если у вас возникли проблемы с
                  подключением к другим устройствам или сети, мы поможем
                  наладить стабильное соединение.
                </li>
              </ol>
              <Styled.SubTitle>
                Процесс ремонта телевизоров Grundig:
              </Styled.SubTitle>
              <ol>
                <li>
                  Диагностика: Мы проводим тщательный анализ вашего телевизора,
                  чтобы выявить неисправность.
                </li>
                <li>
                  Оценка стоимости: После диагностики мы делаем оценку стоимости
                  ремонта и разворачиваем план действий.
                </li>
                <li>
                  Профессиональный ремонт: Наши мастера выполняют ремонт,
                  используя только оригинальные запчасти.
                </li>
                <li>
                  Тестирование и гарантия: После восстановления телевизора мы
                  проводим тестирование, чтобы убедиться, что все функции
                  работают должным образом.
                </li>
              </ol>
              <Styled.SubTitle>Обращайтесь к нам:</Styled.SubTitle>
              <p>
                Если ваш телевизор Grundig требует ремонта, не стесняйтесь
                обращаться к нам. Наши специалисты готовы предоставить
                качественную и надежную помощь для восстановления
                работоспособности вашего оборудования. Обратитесь к нам уже
                сегодня, и ваш телевизор Grundig снова станет надежным
                источником развлечений и информации!
              </p>
            </Styled.Page>
          ) : (
            <Styled.Page>
              <h1>
                Ремонт телевізорів Grundig: якісна реставрація вашого
                телевізійного досвіду
              </h1>
              <Styled.AfterTitle>
                Телевізори Grundig – це не тільки джерело інформації та розваг,
                але й важливий елемент вашого домашнього комфорту. Однак іноді
                навіть надійні технічні рішення можуть стикнутися з поломкою.
                Якщо ваш телевізор Grundig потребує ремонту, наша компанія
                готова надати вам професійні послуги для відновлення якості
                зображення та звуку.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому обирати нас для ремонту телевізорів Grundig?
              </Styled.SubTitle>
              <ol>
                <li>
                  Експертні знання: Наша команда фахівців володіє глибокими
                  знаннями у сфері ремонту та обслуговування телевізорів
                  Grundig. Ми розуміємо усі тонкощі цієї техніки та вміємо
                  вирішувати різноманітні проблеми.
                </li>
                <li>
                  Кваліфіковані майстри: Наші спеціалісти проходять обов'язкове
                  навчання та мають багаторічний досвід роботи з телевізорами
                  Grundig. Вони знають, як ефективно виявляти та виправляти
                  несправності.
                </li>
                <li>
                  Використання оригінальних деталей: Ми використовуємо лише
                  оригінальні запчастини під час ремонту, щоб забезпечити
                  найвищу якість відновлення вашого телевізора.
                </li>
                <li>
                  Швидка реакція: Розуміючи важливість роботи телевізора, ми
                  намагаємося виконати ремонт якнайшвидше, щоб ви могли знову
                  насолоджуватися переглядом улюблених програм.
                </li>
              </ol>
              <Styled.SubTitle>
                Поширені проблеми, які ми вирішуємо:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблеми зі зображенням: Якщо ваш телевізор Grundig має
                  розмите зображення, дивні смуги чи інші артефакти, ми
                  допоможемо вам відновити чіткість та якість картинки.
                </li>
                <li>
                  Проблеми зі звуком: Не чуєте звуку або якість звуку погіршена?
                  Наші майстри знайдуть кореневу причину та відновлять звуковий
                  потік.
                </li>
                <li>
                  Проблеми з підключенням: Якщо у вас є проблеми з підключенням
                  до інших пристроїв чи мережі, ми допоможемо налагодити
                  стабільне з'єднання.
                </li>
              </ol>
              <Styled.SubTitle>
                Процес ремонту телевізорів Grundig:
              </Styled.SubTitle>
              <ol>
                <li>
                  Діагностика: Ми проводимо ретельний аналіз вашого телевізора,
                  щоб виявити несправність.
                </li>
                <li>
                  Оцінка вартості: Після діагностики ми робимо оцінку вартості
                  ремонту та розгортаємо план дій.
                </li>
                <li>
                  Професійний ремонт: Наші майстри виконують ремонт,
                  використовуючи тільки оригінальні запчастини.
                </li>
                <li>
                  Тестування і гарантія: Після відновлення телевізора ми
                  проводимо тестування, щоб переконатися, що всі функції
                  працюють належним чином.
                </li>
              </ol>
              <Styled.SubTitle>Звертайтеся до нас:</Styled.SubTitle>
              <p>
                Якщо ваш телевізор Grundig потребує ремонту, не вагайтеся
                звертатися до нас. Наші спеціалісти готові надати якісну та
                надійну допомогу для відновлення робочого стану вашого
                обладнання. Зверніться до нас вже сьогодні, і ваш телевізор
                Grundig знову стане надійним джерелом розваг та інформації!
              </p>
            </Styled.Page>
          )}
        </Container>
      </Section>
    </>
  );
}
