import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import Layout from "@/components/BrandsPage/Layout";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";

export default function JVC() {
  const { locale } = useRouter();
  return (
    <Layout>
      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <Styled.Page>
              <h1>
                Ремонт телевизоров JVC: Профессиональные услуги для безупречного
                телевизионного опыта
              </h1>
              <Styled.AfterTitle>
                Телевизоры JVC - это современные технологии и высокое качество
                изображения, которые помогают создать непревзойденный опыт
                просмотра. Но даже самая продуктивная техника может потребовать
                ремонта. Если ваш телевизор JVC нуждается в восстановлении
                рабочей способности, наша компания предлагает профессиональные
                услуги по ремонту.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему стоит выбирать нас для ремонта телевизоров JVC?
              </Styled.SubTitle>
              <ol>
                <li>
                  Экспертность: Наша команда обладает глубокими знаниями в
                  области ремонта телевизоров JVC. Мы понимаем технологии и
                  можем выявить и исправить любые проблемы.
                </li>
                <li>
                  Квалифицированные мастера: Наши специалисты имеют многолетний
                  опыт работы с телевизорами JVC и прошли специальное обучение.
                  Они умеют эффективно выявлять и устранять неисправности.
                </li>
                <li>
                  Оригинальные запчасти: Мы используем только оригинальные
                  детали для ремонта, чтобы гарантировать отличное качество
                  восстановления вашего телевизора.
                </li>
                <li>
                  Быстрая реакция: Мы понимаем, как важно для вас быстро
                  восстановить работу телевизора. Поэтому стараемся предоставить
                  услуги ремонта как можно скорее.
                </li>
              </ol>
              <Styled.SubTitle>
                Распространенные проблемы, которые мы решаем:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблемы с изображением: Будь то пятна на экране или
                  размытость изображения - наши специалисты выявят и исправят
                  любые проблемы с изображением.
                </li>
                <li>
                  Проблемы со звуком: Отсутствие звука или его плохое качество?
                  Мы найдем причину проблемы и восстановим нормальную работу
                  аудиосистемы.
                </li>
                <li>
                  Подключение к сети: Если у вас возникли проблемы с
                  подключением к интернету или другими устройствами, мы готовы
                  помочь вам.
                </li>
              </ol>
              <Styled.SubTitle>
                Процесс ремонта телевизоров JVC:
              </Styled.SubTitle>
              <ol>
                <li>
                  Диагностика: Наши мастера проводят детальный анализ вашего
                  телевизора, чтобы выяснить источник проблемы.
                </li>
                <li>
                  Оценка стоимости: После диагностики мы предоставляем вам
                  оценку стоимости ремонта и оглашаем дальнейшие действия.
                </li>
                <li>
                  Ремонт: Используя оригинальные детали, мы проводим ремонт
                  телевизора.
                </li>
                <li>
                  Тестирование и гарантия: После ремонта мы проводим
                  тестирование, чтобы убедиться, что ваш телевизор работает
                  должным образом.
                </li>
              </ol>
              <Styled.SubTitle>Обращайтесь к нам:</Styled.SubTitle>
              <p>
                Если ваш телевизор JVC нуждается в ремонте, не стесняйтесь
                обращаться к нам. Мы гарантируем вам качественный и надежный
                ремонт, который вернет вашему телевизору жизнеспособность и
                отличное изображение и звук. Не сомневайтесь связаться с нами,
                чтобы получить профессиональную помощь от наших экспертов.
              </p>
            </Styled.Page>
          ) : (
            <Styled.Page>
              <h1>
                Ремонт телевізорів JVC: Професійні послуги для бездоганного
                телевізійного досвіду
              </h1>
              <Styled.AfterTitle>
                Телевізори JVC – це сучасні технології та висока якість
                зображення, які допомагають створити неперевершений досвід
                перегляду. Але навіть найпродуктивніша техніка може вимагати
                ремонту. Якщо ваш телевізор JVC потребує відновлення робочої
                здатності, наша компанія пропонує професійні послуги з ремонту.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому варто обирати нас для ремонту телевізорів JVC?
              </Styled.SubTitle>
              <ol>
                <li>
                  Експертність: Наша команда має глибокі знання у сфері ремонту
                  телевізорів JVC. Ми розуміємо технології та можемо виявити та
                  виправити будь-які проблеми.
                </li>
                <li>
                  Кваліфіковані майстри: Наші фахівці мають багаторічний досвід
                  роботи з телевізорами JVC та пройшли спеціальне навчання. Вони
                  вміють ефективно виявляти та усувати несправності.
                </li>
                <li>
                  Оригінальні запчастини: Ми використовуємо лише оригінальні
                  деталі для ремонту, щоб гарантувати відмінну якість
                  відновлення вашого телевізора.
                </li>
                <li>
                  Швидка реакція: Ми розуміємо, як важливо для вас швидко
                  відновити роботу телевізора. Тому намагаємося надати послуги
                  ремонту якнайшвидше.
                </li>
              </ol>
              <Styled.SubTitle>
                Поширені проблеми, які ми вирішуємо:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблеми зі зображенням: Чи то плями на екрані, чи розмитість
                  зображення – наші фахівці виявлять та виправлять будь-які
                  проблеми зі зображенням.
                </li>
                <li>
                  Проблеми зі звуком: Відсутність звуку чи його погана якість?
                  Ми знайдемо причину проблеми та відновимо нормальну роботу
                  аудіосистеми.
                </li>
                <li>
                  Підключення до мережі: Якщо у вас виникли проблеми з
                  підключенням до Інтернету чи інших пристроїв, ми готові вам
                  допомогти.
                </li>
              </ol>
              <Styled.SubTitle>Процес ремонту телевізорів JVC:</Styled.SubTitle>
              <ol>
                <li>
                  Діагностика: Наші майстри проводять детальний аналіз вашого
                  телевізора, щоб з'ясувати джерело проблеми.
                </li>
                <li>
                  Оцінка вартості: Після діагностики ми надаємо вам оцінку
                  вартості ремонту та оголошуємо подальші дії.
                </li>
                <li>
                  Ремонт: Використовуючи оригінальні деталі, ми проводимо ремонт
                  телевізора.
                </li>
                <li>
                  Тестування та гарантія: Після ремонту ми проводимо тестування,
                  щоб переконатися, що ваш телевізор працює належним чином.
                </li>
              </ol>
              <Styled.SubTitle>Звертайтеся до нас:</Styled.SubTitle>
              <p>
                Якщо ваш телевізор JVC потребує ремонту, звертайтеся до наших
                фахівців. Ми гарантуємо вам якісний та надійний ремонт, який
                поверне вашому телевізору життєздатність та чудовий зображення і
                звук. Не вагайтеся зв'язатися з нами, щоб отримати професійну
                допомогу від наших експертів.
              </p>
            </Styled.Page>
          )}
        </Container>
      </Section>
    </Layout>
  );
}
