import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import Head from "next/head";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";

export default function Kivi() {
  const { locale } = useRouter();
  return (
    <>
      <Head>
        <title>
          {locale === "ua"
            ? "Ремонт телевізорів Kivi"
            : "Ремонт телевизоров Kivi"}
        </title>
        <meta
          name="description"
          key="desc"
          content={
            locale === "ua"
              ? "Ремонт телевізорів Kivi у Києві"
              : "Ремонт телевізорів Kivi в Киеве"
          }
        />
      </Head>
      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <Styled.Page>
              <h1>Профессиональный ремонт телевизоров KIVI в Киеве</h1>
              <Styled.AfterTitle>
                Мы специализируемся на ремонте и обслуживании телевизоров KIVI.
                Наша команда квалифицированных техников имеет глубокие знания и
                многолетний опыт работы с этими телевизорами, что позволяет нам
                точно диагностировать и устранять любые проблемы.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему выбирать нас для ремонта телевизоров KIVI:
              </Styled.SubTitle>
              <ol>
                <li>
                  Профессионализм и опыт: Наша команда состоит из
                  профессионалов, знающих каждый аспект техники KIVI. Мы знаем,
                  как эти телевизоры работают внутри и снаружи, поэтому мы можем
                  диагностировать и исправлять любую проблему.
                </li>
                <li>
                  Оригинальные запчасти: Мы используем только оригинальные
                  запчасти KIVI при ремонте для обеспечения высокого качества и
                  продолжительности восстановления вашего телевизора.
                </li>
                <li>
                  Быстрота и надежность: Мы понимаем, как важно для вас быстро
                  восстановить работу телевизора. Поэтому наши техники работают
                  оперативно и эффективно, чтобы вы могли снова наслаждаться
                  просмотром любимых программ.
                </li>
                <li>
                  Широкий спектр услуг: Мы ремонтируем все от проблем с
                  изображением и аудио до отказов питания и разъемов. Независимо
                  от того, какие проблемы имеет ваш телевизор KIVI, мы знаем,
                  как их решить.
                </li>
              </ol>
              <Styled.SubTitle>Процесс ремонта:</Styled.SubTitle>
              <ol>
                <li>
                  Диагностика: Наши техники тщательно проверяют ваш телевизор
                  KIVI, чтобы выявить причину проблемы.
                </li>
                <li>
                  Смета: После диагностики мы даем вам подробную оценку
                  стоимости ремонта.
                </li>
                <li>
                  Ремонт: После вашего согласования мы приступаем к ремонту,
                  используя только оригинальные запчасти KIVI.
                </li>
                <li>
                  Тестирование: После ремонта мы тщательно тестируем телевизор,
                  чтобы убедиться, что он работает должным образом.
                </li>
                <li>
                  Гарантия: Мы предоставляем гарантию на проделанную работу и
                  использованные запчасти.
                </li>
              </ol>
              <Styled.SubTitle>Обратитесь к нам сегодня:</Styled.SubTitle>
              <p>
                Если ваш телевизор KIVI требует ремонта, не теряйте время.
                Обратитесь к нам сегодня, и наша команда профессионалов
                восстановит его до оптимального рабочего состояния. Мы гордимся
                предоставлять качественные и надежные услуги ремонта телевизоров
                KIVI.
              </p>
            </Styled.Page>
          ) : (
            <Styled.Page>
              <h1>Професійний ремонт телевізорів KIVI у Києві</h1>
              <Styled.AfterTitle>
                Ми спеціалізуємося на ремонті та обслуговуванні телевізорів
                марки KIVI. Наша команда кваліфікованих техніків має глибокі
                знання та багаторічний досвід у роботі з цими телевізорами, що
                дозволяє нам точно діагностувати та усувати будь-які проблеми.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому обирати нас для ремонту телевізорів KIVI:
              </Styled.SubTitle>
              <ol>
                <li>
                  Професіоналізм і досвід: Наша команда складається з
                  професіоналів, які знають кожен аспект техніки KIVI. Ми
                  знаємо, як працюють ці телевізори всередині та зовні, тому ми
                  можемо діагностувати і виправляти будь-яку проблему
                </li>
                <li>
                  Оригінальні запчастини: Ми використовуємо лише оригінальні
                  запчастини KIVI під час ремонту, щоб забезпечити найвищу
                  якість та тривалість відновлення вашого телевізора.
                </li>
                <li>
                  Швидкість і надійність: Ми розуміємо, як важливо для вас
                  швидко відновити роботу телевізора. Тому наші техніки працюють
                  оперативно і ефективно, щоб ви могли знову насолоджуватися
                  переглядом улюблених програм.
                </li>
                <li>
                  Широкий спектр послуг: Ми ремонтуємо все, від проблем зі
                  зображенням та аудіо до відмов живлення та роз'ємів. Незалежно
                  від того, які проблеми має ваш телевізор KIVI, ми знаємо, як
                  їх вирішити.
                </li>
              </ol>
              <Styled.SubTitle>Процес ремонту:</Styled.SubTitle>
              <ol>
                <li>
                  Діагностика: Наші техніки ретельно перевіряють ваш телевізор
                  KIVI, щоб виявити причину проблеми.
                </li>
                <li>
                  Смета: Після діагностики ми надаємо вам детальну оцінку
                  вартості ремонту.
                </li>
                <li>
                  Ремонт: Після вашого погодження ми розпочинаємо ремонт,
                  використовуючи лише оригінальні запчастини KIVI.
                </li>
                <li>
                  Тестування: Після виконання ремонту ми ретельно тестуємо
                  телевізор, щоб переконатися, що він працює належним чином.
                </li>
                <li>
                  Гарантія: Ми надаємо гарантію на виконану роботу та
                  використані запчастини.
                </li>
              </ol>
              <Styled.SubTitle>Зверніться до нас сьогодні:</Styled.SubTitle>
              <p>
                Якщо ваш телевізор KIVI потребує ремонту, не гайте часу.
                Зверніться до нас сьогодні, і наша команда професіоналів
                відновить його до оптимальної робочої стану. Ми горді надавати
                якісні та надійні послуги ремонту телевізорів KIVI.
              </p>
            </Styled.Page>
          )}
        </Container>
      </Section>
    </>
  );
}
