import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import Head from "next/head";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";

export default function LG() {
  const { locale } = useRouter();
  return (
    <>
      <Head>
        <title>
          {locale === "ua" ? "Ремонт телевізорів LG" : "Ремонт телевизоров LG"}
        </title>
        <meta
          name="description"
          key="desc"
          content={
            locale === "ua"
              ? "Ремонт телевізорів LG у Києві"
              : "Ремонт телевізорів LG в Киеве"
          }
        />
      </Head>
      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <div>
              <h1>
                Ремонте телевизоров LG: Профессиональный подход к восстановлению
                Вашего телевизора
              </h1>
              <Styled.AfterTitle>
                Телевизоры LG завоевали популярность благодаря передовой
                технологии и впечатляющему качеству воспроизведения. Однако ни
                одна электроника не является вечной, и они также могут
                столкнуться с техническими неполадками. Если ваш телевизор LG
                требует ремонта, наша компания готова предоставить
                профессиональные услуги, чтобы вернуть ему оптимальную работу и
                качество воспроизведения.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему Вы должны выбрать нас для ремонта телевизоров LG?
              </Styled.SubTitle>
              <ol>
                <li>
                  Глубокие знания в технологии LG: Наша команда техников
                  обладает глубокими знаниями и опытом в ремонте телевизоров LG.
                  Мы понимаем и распознаем особенности этих устройств, что
                  позволяет нам быстро выявлять причины неполадок.
                </li>
                <li>
                  Квалифицированные специалисты: Наша команда состоит из
                  квалифицированных техников, которые имеют опыт в ремонте
                  телевизоров LG. Они знают, как работают эти устройства как
                  внутри, так и снаружи, и могут эффективно решить разнообразные
                  проблемы.
                </li>
                <li>
                  Оригинальные запчасти: Для ремонта мы используем только
                  оригинальные запчасти LG. Это обеспечивает надежность,
                  качество и долговечность ремонтных работ.
                </li>
                <li>
                  Скорость и надежность: Мы понимаем, как важно для вас быстро
                  вернуть свой телевизор в рабочее состояние. Наши техники
                  работают оперативно, чтобы обеспечить минимальное время
                  простоя.
                </li>
              </ol>
              <Styled.SubTitle>Ремонт различных проблем:</Styled.SubTitle>
              <ol>
                <li>
                  Проблемы с отображением: От неправильного воспроизведения до
                  полного отсутствия изображения – мы готовы выявить и решить
                  любые проблемы с отображением.
                </li>
                <li>
                  Аудио неполадки: Если у вас возникли проблемы со звуком - нет
                  звука или качество звука ухудшилось – наши специалисты смогут
                  восстановить аудиофункции вашего телевизора.
                </li>
                <li>
                  Проблемы с подключением и сетью: Проблемы с подключением,
                  Wi-Fi или другими сетевыми возможностями? Мы способны
                  исправить эти проблемы и обеспечить нормальную работу сети.
                </li>
              </ol>
              <Styled.SubTitle>Процесс ремонта телевизоров LG:</Styled.SubTitle>
              <ol>
                <li>
                  Диагностика: Наши специалисты тщательно проверяют ваш
                  телевизор LG для выявления корней проблемы.
                </li>
                <li>
                  Оценка стоимости: После диагностики мы предоставляем вам
                  подробную оценку стоимости ремонта.
                </li>
                <li>
                  Профессиональный ремонт: После вашего согласия мы начинаем
                  ремонт с использованием оригинальных запчастей LG.
                </li>
                <li>
                  Тестирование и гарантия: После завершения ремонта мы тщательно
                  тестируем телевизор и предоставляем гарантию на выполненную
                  работу.
                </li>
              </ol>
              <Styled.SubTitle>Обращайтесь к нам:</Styled.SubTitle>
              <p>
                Если ваш телевизор LG сталкивается с какими-либо проблемами,
                обращайтесь к нам. Наша команда экспертов готова помочь вам
                восстановить его работу и обеспечить качественный ремонт. Не
                теряйте времени - свяжитесь с нами уже сегодня и верните свой
                телевизор LG к жизни!
              </p>
            </div>
          ) : (
            <div>
              <h1>
                Ремонт телевізорів LG: Професійний підхід до відновлення Вашого
                телевізора
              </h1>
              <Styled.AfterTitle>
                Телевізори LG завоювали популярність завдяки передовій
                технології та вражаючому якості відтворення. Проте, ні одна
                електроніка не є вічною, і вони також можуть стикнутися з
                технічними неполадками. Якщо ваш телевізор LG потребує ремонту,
                наша компанія готова надати професійні послуги, щоб повернути
                йому оптимальну роботу та якість відтворення.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому Ви повинні обрати нас для ремонту телевізорів LG?
              </Styled.SubTitle>
              <ol>
                <li>
                  Глибокі знання в технології LG: Наша команда техніків володіє
                  глибокими знаннями та досвідом у ремонті телевізорів LG. Ми
                  розуміємо та впізнаємо особливості цих пристроїв, що дозволяє
                  нам швидко виявляти причини неполадок.
                </li>
                <li>
                  Кваліфіковані фахівці: Наша команда складається з
                  кваліфікованих техніків, які мають досвід у ремонті
                  телевізорів LG. Вони знають, як працюють ці пристрої всередині
                  і можуть ефективно вирішити різноманітні проблеми.
                </li>
                <li>
                  Оригінальні запчастини: Для ремонту ми використовуємо лише
                  оригінальні запчастини LG. Це дозволяє забезпечити надійність,
                  якість та довговічність ремонтних робіт.
                </li>
                <li>
                  Швидкість та надійність: Ми розуміємо, як важливо для вас
                  швидко повернути свій телевізор у робочий стан. Наші техніки
                  працюють оперативно, щоб забезпечити мінімальний час простою.
                </li>
              </ol>
              <Styled.SubTitle>Ремонт різних проблем:</Styled.SubTitle>
              <ol>
                <li>
                  Проблеми з відображенням: Від неправильного відтворення до
                  зовсім відсутнього зображення – ми готові виявити та вирішити
                  будь-які проблеми з відображенням.
                </li>
                <li>
                  Аудіо неполадки: Якщо у вас виникли проблеми зі звуком - немає
                  звуку або якість звуку погіршилася – наші фахівці зможуть
                  відновити аудіофункції вашого телевізора.
                </li>
                <li>
                  Підключення та мережеві проблеми: Проблеми з підключенням,
                  Wi-Fi або іншими мережевими можливостями? Ми здатні виправити
                  ці проблеми та забезпечити належну роботу мережі.
                </li>
              </ol>
              <Styled.SubTitle>Процес ремонту телевізорів LG:</Styled.SubTitle>
              <ol>
                <li>
                  Діагностика: Наші фахівці ретельно перевіряють ваш телевізор
                  LG для визначення коренів проблеми.
                </li>
                <li>
                  Оцінка вартості: Після діагностики ми надаємо вам детальну
                  оцінку вартості ремонту.
                </li>
                <li>
                  Професійний ремонт: Після вашої згоди ми розпочинаємо ремонт з
                  використанням оригінальних запчастин LG.
                </li>
                <li>
                  Тестування та Гарантія: Після завершення ремонту ми ретельно
                  тестуємо телевізор та надаємо гарантію на проведені роботи.
                </li>
              </ol>
              <Styled.SubTitle>Звертайтеся до нас:</Styled.SubTitle>
              <p>
                Якщо ваш телевізор LG стикається з будь-якими проблемами,
                звертайтеся до нас. Наша команда експертів готова допомогти вам
                відновити його роботу та забезпечити якісний ремонт. Не гайте
                часу - зв'яжіться з нами вже сьогодні і поверніть свій телевізор
                LG до життя!
              </p>
            </div>
          )}
        </Container>
      </Section>
    </>
  );
}
