import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";
import Layout from "@/components/BrandsPage/Layout";

export default function Pioneer() {
  const { locale } = useRouter();
  return (
    <Layout>

      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <Styled.Page>
              <h1>
                Ремонт телевизоров Pioneer: Восстановление высокого качества
                изображения и звука
              </h1>
              <Styled.AfterTitle>
                Телевизоры Pioneer завоевали свою репутацию благодаря
                выдающемуся качеству воспроизведения изображения и звука. Однако
                даже высококачественная техника может столкнуться с поломками и
                неисправностями. Если ваш телевизор Pioneer требует ремонта,
                наша компания готова предоставить профессиональные услуги
                восстановления изображения и звука для вашего телевизора.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему выбрать нас для ремонта телевизоров Pioneer?
              </Styled.SubTitle>
              <ol>
                <li>
                  Экспертиза в технологии Pioneer: Наша команда техников имеет
                  многолетний опыт в ремонте телевизоров Pioneer. Мы понимаем
                  тонкости технологии Pioneer, что позволяет нам быстро выявлять
                  и устранять разнообразные проблемы.
                </li>
                <li>
                  Квалифицированные техники: Наша команда состоит из
                  квалифицированных техников, которые прошли специальное
                  обучение в области ремонта телевизоров Pioneer. Они умеют
                  диагностировать и устранять неисправности эффективно.
                </li>
                <li>
                  Использование оригинальных запчастей: Мы используем только
                  оригинальные запчасти Pioneer для замены поврежденных
                  компонентов. Это помогает сохранить качество и долговечность
                  ремонтных работ.
                </li>
                <li>
                  Быстрая и надежная работа: Мы понимаем, насколько важно для
                  вас быстро восстановить работу вашего телевизора. Наша
                  преданная команда стремится предоставить быструю и надежную
                  работу без компромиссов.
                </li>
              </ol>
              <Styled.SubTitle>
                Устранение разнообразных неисправностей:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблемы с отображением: Независимо от того, есть у вас
                  проблемы с качеством изображения или даже его отсутствием, мы
                  готовы восстановить его до оптимального уровня.
                </li>
                <li>
                  Проблемы со звуком: Если у вас возникли проблемы с звуком,
                  такие как отсутствие звука или низкое качество, наши
                  специалисты смогут их эффективно устранить.
                </li>
                <li>
                  Проблемы с подключением: Мы готовы решить проблемы с
                  подключением, включая HDMI, USB и другие порты.
                </li>
              </ol>
              <Styled.SubTitle>
                Процесс ремонта телевизоров Pioneer:
              </Styled.SubTitle>
              <ol>
                <li>
                  Диагностика: Наши техники тщательно исследуют ваш телевизор
                  Pioneer, чтобы выявить коренную причину неисправности.
                </li>
                <li>
                  Оценка стоимости: После диагностики мы предоставляем вам
                  подробную оценку стоимости ремонтных работ.
                </li>
                <li>
                  Профессиональный ремонт: После вашего согласия мы начинаем
                  процесс ремонта с использованием только оригинальных
                  компонентов.
                </li>
                <li>
                  Тестирование и гарантия: После завершения ремонта мы тщательно
                  тестируем ваш телевизор, чтобы убедиться в его оптимальной
                  работе, и предоставляем гарантию на нашу работу.
                </li>
              </ol>
              <Styled.SubTitle>Обращайтесь к нам:</Styled.SubTitle>
              <p>
                Если ваш телевизор Pioneer требует ремонта, обращайтесь к нам.
                Наша экспертная команда готова восстановить качество изображения
                и звука вашего телевизора. Не теряйте времени - свяжитесь с нами
                уже сегодня и верните ваш телевизор Pioneer к его лучшему
                состоянию!
              </p>
            </Styled.Page>
          ) : (
            <Styled.Page>
              <h1>
                Ремонт телевізорів Pioneer: Відновлення високої якості
                зображення та звуку
              </h1>
              <Styled.AfterTitle>
                Телевізори Pioneer завоювали свою репутацію завдяки надзвичайній
                якості відтворення зображення та звуку. Однак, навіть
                високоякісна техніка може зазнавати поломок та неполадок. Якщо
                ваш телевізор Pioneer потребує ремонту, наша компанія пропонує
                професійні послуги відновлення зображення та звуку для вашого
                телевізора.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому вибрати нас для ремонту телевізорів Pioneer?
              </Styled.SubTitle>
              <ol>
                <li>
                  Експертиза у технології Pioneer: Наша команда техніків має
                  багаторічний досвід у ремонті телевізорів Pioneer. Ми
                  розуміємо тонкощі технології Pioneer, що дозволяє нам швидко
                  виявляти та усувати різноманітні проблеми.
                </li>
                <li>
                  Кваліфіковані техніки: Наша команда складається з
                  кваліфікованих техніків, які пройшли спеціальне навчання в
                  галузі ремонту телевізорів Pioneer. Вони вміють діагностувати
                  та усувати неполадки ефективно.
                </li>
                <li>
                  Використання оригінальних запчастин: Ми використовуємо лише
                  оригінальні запчастини Pioneer для заміни пошкоджених
                  компонентів. Це допомагає зберегти якість та довговічність
                  ремонтних робіт.
                </li>
                <li>
                  Швидка та надійна робота: Ми розуміємо, наскільки важливо для
                  вас швидко відновити роботу вашого телевізора. Наша віддана
                  команда прагне надати швидку та надійну роботу без жодних
                  компромісів.
                </li>
              </ol>
              <Styled.SubTitle>
                Усунення різноманітних несправностей:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблеми з відображенням: Незалежно від того, чи є у вас
                  проблеми з якістю зображення, чи навіть відсутність
                  зображення, ми готові відновити його до оптимального рівня.
                </li>
                <li>
                  Проблеми зі звуком: Якщо ви зіткнулися з проблемами зі звуком,
                  такими як немає звуку або низька якість, наші фахівці зможуть
                  усунути їх ефективно.
                </li>
                <li>
                  Проблеми з підключенням: Ми готові вирішити проблеми з
                  підключенням, включаючи HDMI, USB та інші порти.
                </li>
              </ol>
              <Styled.SubTitle>
                Процес ремонту телевізорів Pioneer:
              </Styled.SubTitle>
              <ol>
                <li>
                  Діагностика: Наші техніки ретельно досліджують ваш телевізор
                  Pioneer, щоб виявити корінну причину неполадки.
                </li>
                <li>
                  Оцінка вартості: Після діагностики ми надаємо вам докладну
                  оцінку вартості ремонтних робіт.
                </li>
                <li>
                  Професійний ремонт: Після вашої згоди ми розпочинаємо процес
                  ремонту з використанням оригінальних запчастин.
                </li>
                <li>
                  Тестування та гарантія: Після завершення ремонту ми тестуємо
                  ваш телевізор, щоб переконатися в його оптимальній роботі, і
                  надаємо гарантію на нашу роботу.
                </li>
              </ol>
              <Styled.SubTitle>Звертайтеся до нас:</Styled.SubTitle>
              <p>
                Якщо ваш телевізор Pioneer потребує ремонту, звертайтеся до нас.
                Наша експертна команда готова відновити якість зображення та
                звуку вашого телевізора. Не гайте часу - зв'яжіться з нами вже
                сьогодні та поверніть ваш телевізор Pioneer до його найкращого
                стану!
              </p>
            </Styled.Page>
          )}
        </Container>
      </Section>
    </Layout>
  );
}
