import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import Head from "next/head";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";

export default function Samsung() {
  const { locale } = useRouter();
  return (
    <>
      <Head>
        <title>
          {locale === "ua"
            ? "Ремонт телевізорів Samsung"
            : "Ремонт телевизоров Samsung"}
        </title>
        <meta
          name="description"
          key="desc"
          content={
            locale === "ua"
              ? "Ремонт телевізорів Samsung у Києві"
              : "Ремонт телевізорів Samsung в Киеве"
          }
        />
      </Head>
      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <div>
              <h1>
                Разрешение проблем с телевизорами Samsung: Экспертные решения
                для непрерывного просмотра
              </h1>
              <Styled.AfterTitle>
                Телевизоры Samsung завоевали репутацию благодаря передовой
                технологии и превосходному качеству изображения. Однако, даже
                самая надежная электроника со временем может столкнуться с
                проблемами. Если ваш телевизор Samsung доставляет неудобства, не
                беспокойтесь! Наша экспертная служба по ремонту телевизоров
                готова предоставить надежные решения, обеспечивая бесперебойное
                удовольствие от просмотра.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему выбрать нашу службу по ремонту телевизоров Samsung?
              </Styled.SubTitle>
              <ol>
                <li>
                  Специализированные знания: Наши техники обладают
                  специализированными знаниями и богатым опытом по ремонту
                  телевизоров Samsung, что позволяет им оперативно
                  диагностировать и устранять проблемы.
                </li>
                <li>
                  Оригинальные запчасти Samsung: Мы используем только
                  оригинальные запчасти Samsung для обеспечения надежной
                  производительности и долговечности вашего телевизора после
                  ремонта.
                </li>
                <li>
                  Быстрая обработка: Мы понимаем неудобства от неисправного
                  телевизора и стремимся предоставить быструю обработку заявок
                  без ущерба для качества работы.
                </li>
                <li>
                  Продвинутые диагностические инструменты: Мы используем
                  современные диагностические инструменты для точной
                  идентификации причины проблемы.
                </li>
              </ol>
              <Styled.SubTitle>
                Распространенные проблемы телевизоров Samsung, которые мы
                устраняем:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблемы с экраном: Если ваш телевизор Samsung имеет треснутый
                  экран, мерцающее изображение или нерабочие пиксели, наши
                  техники смогут определить повреждение и выполнить необходимые
                  ремонтные работы или замену экрана.
                </li>
                <li>
                  Проблемы с аудио: Если у вас возникли проблемы с звуком на
                  телевизоре, такие как отсутствие звука или искаженный звук,
                  наши эксперты смогут выявить и устранить неисправности
                  аудиокомпонентов.
                </li>
                <li>
                  Проблемы с подключением: Не работают функции смарт-телевизора?
                  Мы решим проблемы, связанные с подключением Wi-Fi, разъемами
                  HDMI и другими сетевыми неполадками.
                </li>
                <li>
                  Проблемы с питанием и программным обеспечением: Если ваш
                  телевизор Samsung не включается, постоянно перезагружается или
                  имеет программные сбои, мы можем провести диагностику и решить
                  эти проблемы.
                </li>
              </ol>
              <Styled.SubTitle>
                Процесс ремонта телевизоров Samsung у нас:
              </Styled.SubTitle>
              <ol>
                <li>
                  Начальная оценка: Наши техники тщательно проверят ваш
                  телевизор Samsung, чтобы выявить проблему.
                </li>
                <li>
                  Прозрачная оценка стоимости: После проверки мы предоставим вам
                  подробную и прозрачную оценку стоимости ремонта.
                </li>
                <li>
                  Профессиональный ремонт: После вашего согласия мы приступим к
                  ремонту с использованием оригинальных запчастей Samsung.
                </li>
                <li>
                  Контроль качества: Перед возвратом телевизора мы проведем
                  тщательную проверку качества, чтобы обеспечить его оптимальную
                  производительность.
                </li>
                <li>
                  Гарантия: Мы гарантируем качество нашего ремонта и
                  предоставляем гарантию на использованные запчасти и работу.
                </li>
              </ol>
              <Styled.SubTitle>Заключение:</Styled.SubTitle>
              <p>
                Неисправность телевизора Samsung не должна нарушать ваше
                удовольствие от просмотра. Доверьтесь нашей экспертной службе по
                ремонту телевизоров Samsung, чтобы вернуть ваш телевизор в
                рабочее состояние. Благодаря опытным техникам, оригинальным
                запчастям и стремлению к совершенству, мы гарантируем ваше
                удовлетворение. Свяжитесь с нами сегодня, чтобы запланировать
                ремонт и снова наслаждаться безупречным просмотром на вашем
                телевизоре Samsung!
              </p>
              <Styled.Warning>
                <span>Отказ от ответственности:</span> Мы являемся независимой
                службой по ремонту телевизоров и не связаны и не одобрены
                компанией Samsung. Использование названия бренда Samsung
                используется исключительно для иллюстративных целей и для
                подчеркивания нашей компетентности в ремонте телевизоров
                Samsung.
              </Styled.Warning>
            </div>
          ) : (
            <div>
              <h1>
                Вирішення проблем з телевізорами Samsung: Експертні рішення для
                безперебійного перегляду
              </h1>
              <Styled.AfterTitle>
                Телевізори Samsung здобули репутацію завдяки передовій
                технології та винятковій якості зображення. Однак, навіть
                найнадійніша електроніка може стикнутися з проблемами з часом.
                Якщо ваш телевізор Samsung створює незручності, не хвилюйтесь!
                Наша експертна служба ремонту телевізорів готова надати надійні
                рішення, забезпечуючи безперебійне задоволення від перегляду.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому обирати нашу службу ремонту телевізорів Samsung?
              </Styled.SubTitle>
              <ol>
                <li>
                  Спеціалізовані знання: Наші техніки мають спеціалізовані
                  знання та великий досвід у ремонті телевізорів Samsung, що
                  дозволяє їм оперативно діагностувати та усувати проблеми.
                </li>
                <li>
                  Оригінальні запчастини Samsung: Ми використовуємо тільки
                  оригінальні запчастини Samsung, щоб забезпечити надійну
                  продуктивність та тривалість вашого телевізора після ремонту.
                </li>
                <li>
                  ОШвидка обробка: Ми розуміємо незручності через несправний
                  телевізор і намагаємося надавати швидку обробку заявок без
                  ушкодження якості роботи.
                </li>
                <li>
                  Покращені діагностичні інструменти: Ми використовуємо сучасні
                  діагностичні інструменти для точної ідентифікації причини
                  проблеми.
                </li>
              </ol>
              <Styled.SubTitle>
                Поширені проблеми телевізорів Samsung, які ми виправляємо:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблеми з екраном: Якщо ваш телевізор Samsung має тріснутий
                  екран, мерехтливе зображення або неробочі пікселі, наші
                  техніки зможуть визначити пошкодження та виконати необхідні
                  ремонтні роботи або заміну екрану.
                </li>
                <li>
                  Проблеми з аудіо: Якщо у вас виникли проблеми із звуком на
                  телевізорі, такі як відсутність звуку або спотворений звук,
                  наші експерти зможуть виявити та усунути несправності
                  аудіокомпонентів.
                </li>
                <li>
                  Проблеми з підключенням: Не працюють функції смарт-телевізора?
                  Ми вирішимо проблеми, пов'язані з підключенням Wi-Fi,
                  роз'ємами HDMI та іншими мережевими неполадками.
                </li>
                <li>
                  Проблеми з живленням та програмним забезпеченням: Якщо ваш
                  телевізор Samsung не вмикається, постійно перезавантажується
                  або має програмні збої, ми зможемо провести діагностику та
                  вирішити ці проблеми.
                </li>
              </ol>
              <Styled.SubTitle>
                Наш процес ремонту телевізорів Samsung:
              </Styled.SubTitle>
              <ol>
                <li>
                  Початкова оцінка: Наші техніки ретельно перевірять ваш
                  телевізор Samsung, щоб виявити проблему.
                </li>
                <li>
                  Прозора оцінка вартості: Після перевірки ми надамо вам
                  детальну та прозору оцінку вартості ремонту.
                </li>
                <li>
                  Професійний ремонт: Після вашої згоди ми розпочнемо ремонт з
                  використанням оригінальних запчастин Samsung.
                </li>
                <li>
                  Контроль якості: Перед поверненням телевізора ми проведемо
                  ретельний контроль якості, щоб забезпечити його оптимальну
                  продуктивність.
                </li>
                <li>
                  Гарантія: Ми гарантуємо якість нашого ремонту і надаємо
                  гарантію на використані запчастини та роботу.
                </li>
              </ol>
              <Styled.SubTitle>Висновок:</Styled.SubTitle>
              <p>
                Несправність телевізора Samsung не повинна заважати вашому
                задоволенню від перегляду. Покладайтеся на нашу експертну службу
                ремонту телевізорів Samsung, щоб повернути ваш телевізор до
                робочого стану. Завдяки досвідченим технікам, оригінальним
                запчастинам та прагненню до вдосконалення, ми гарантуємо вашу
                задоволеність. Зв'яжіться з нами сьогодні, щоб запланувати
                ремонт та знову насолоджуватися бездоганним переглядом на вашому
                телевізорі Samsung!
              </p>
              <Styled.Warning>
                <span>Увага:</span> Ми є незалежною службою ремонту телевізорів
                і не є пов'язані з компанією Samsung або не отримали її
                схвалення. Використання назви бренду Samsung здійснюється
                виключно для ілюстративних цілей і для підкреслення нашої
                компетентності у ремонті телевізорів Samsung.
              </Styled.Warning>
            </div>
          )}
        </Container>
      </Section>
    </>
  );
}
