import Section from "@/components/common/styles/Section.styled";
import Container from "@/components/common/styles/Container.styled";
import Layout from "@/components/BrandsPage/Layout";
import { useRouter } from "next/router";
import * as Styled from "@/components/BrandsPage/styles/BrandsPages.styled";

export default function Xiaomi() {
  const { locale } = useRouter();
  return (
    <Layout>
      <Section $screenHeight>
        <Container>
          {locale === "ru" ? (
            <Styled.Page>
              <h1>
                Профессиональные услуги по ремонту телевизоров Xiaomi: Гарантия
                связи и производительности
              </h1>
              <Styled.AfterTitle>
                Телевизоры Xiaomi стали популярными благодаря передовой
                технологии и доступной цене, что делает их излюбленным выбором
                для любителей технических новинок. Однако, как и любое
                электронное устройство, телевизоры Xiaomi могут столкнуться с
                техническими проблемами. Если ваш телевизор Xiaomi имеет
                проблемы с подключением или производительностью, наши опытные
                услуги по ремонту телевизоров готовы восстановить связь и
                обеспечить его оптимальную работу.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Почему выбрать наши услуги по ремонту телевизоров Xiaomi?
              </Styled.SubTitle>
              <ol>
                <li>
                  Экспертиза в технологии Xiaomi: Наши техники обладают
                  обширными знаниями и опытом ремонта телевизоров Xiaomi. Они
                  хорошо знакомы с уникальной технологией Xiaomi, что позволяет
                  им эффективно диагностировать и устранять проблемы.
                </li>
                <li>
                  Квалифицированные специалисты: Наша команда техников проходит
                  специализированное обучение по ремонту телевизоров Xiaomi,
                  обеспечивая высокий уровень обслуживания.
                </li>
                <li>
                  Оригинальные запчасти Xiaomi: Мы используем оригинальные
                  запчасти Xiaomi, чтобы сохранить качество и надежность вашего
                  телевизора.
                </li>
                <li>
                  Быстрый и надежный сервис: Мы понимаем важность
                  функционального телевизора, и наша преданная команда стремится
                  предоставить быстрый и надежный ремонт.
                </li>
              </ol>
              <Styled.SubTitle>
                Типичные проблемы с телевизорами Xiaomi, которые мы устраняем:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблемы с подключением: Если ваш телевизор Xiaomi имеет
                  проблемы с Wi-Fi или трудности с подключением к другим
                  устройствам, мы можем выявить и устранить проблемы связи.
                </li>
                <li>
                  Проблемы с материнской платой: Если ваш телевизор имеет
                  проблемы с программным обеспечением или связанные с
                  материнской платой, наши опытные техники смогут их решить.
                </li>
                <li>
                  Замена экрана: В случае повреждения или неисправности экрана,
                  мы обладаем опытом замены его на оригинальный экран Xiaomi.
                </li>
                <li>
                  Проблемы с аудио: Если у вашего телевизора Xiaomi возникли
                  проблемы со звуком, такие как отсутствие звука или плохое
                  качество звука, мы можем выявить и ремонтировать аудиоцепь.
                </li>
              </ol>
              <Styled.SubTitle>
                Наш процесс ремонта телевизоров Xiaomi:
              </Styled.SubTitle>
              <ol>
                <li>
                  Комплексный осмотр: Наши техники проводят тщательный осмотр,
                  чтобы определить причину проблемы.
                </li>
                <li>
                  Детальная оценка: После диагностики мы предоставляем вам
                  детальную оценку стоимости ремонта.
                </li>
                <li>
                  Качественный ремонт: Используя оригинальные запчасти Xiaomi,
                  мы приступаем к ремонту для обеспечения оптимальной
                  производительности..
                </li>
                <li>
                  Тщательное тестирование: Перед возвратом вашего телевизора, мы
                  проводим тщательное тестирование, чтобы убедиться в его
                  безупречной работе.
                </li>
                <li>
                  Гарантия: Мы гарантируем качество нашего ремонта и
                  предоставляем гарантию на использованные запчасти и работы.
                </li>
              </ol>
              <Styled.SubTitle>Заключение:</Styled.SubTitle>
              <p>
                Доверьтесь нашим опытным услугам по ремонту телевизоров Xiaomi,
                чтобы восстановить связь и производительность вашего телевизора
                Xiaomi. С нашими знаниями в области технологии Xiaomi,
                квалифицированными специалистами и оригинальными запчастями
                Xiaomi, мы гарантируем эффективный и эффективный опыт ремонта.
                Свяжитесь с нами сегодня, чтобы запланировать ремонт и
                наслаждаться бесперебойной работой вашего телевизора Xiaomi
                снова.
              </p>
            </Styled.Page>
          ) : (
            <Styled.Page>
              <h1>
                Кваліфіковані послуги ремонту телевізорів Xiaomi: Забезпечення
                зв'язку та продуктивності
              </h1>
              <Styled.AfterTitle>
                Телевізори Xiaomi здобули популярність завдяки передовій
                технології та доступній ціновій політиці, що робить їх улюбленим
                вибором для технологічних користувачів. Проте, як і будь-який
                електронний пристрій, телевізори Xiaomi можуть стикатися з
                технічними проблемами. Якщо ваш телевізор Xiaomi має проблеми з
                підключенням або зіткнувся з недоліками продуктивності, наші
                кваліфіковані послуги з ремонту телевізорів тут, щоб відновити
                зв'язок та забезпечити, що ваш телевізор працює належним чином.
              </Styled.AfterTitle>
              <Styled.SubTitle>
                Чому обирати наші послуги ремонту телевізорів Xiaomi?
              </Styled.SubTitle>
              <ol>
                <li>
                  Експертність в технології Xiaomi: Наші техніки мають обширні
                  знання та досвід у ремонті телевізорів Xiaomi. Вони добре
                  знайомі з унікальною технологією Xiaomi, що дозволяє їм
                  ефективно діагностувати та вирішувати проблеми.
                </li>
                <li>
                  Кваліфіковані техніки: Наша команда техніків проходить
                  спеціальну підготовку для виконання ремонту телевізорів
                  Xiaomi, забезпечуючи високий стандарт обслуговування.
                </li>
                <li>
                  Оригінальні запчастини Xiaomi: Ми використовуємо оригінальні
                  запчастини Xiaomi, щоб зберегти якість та надійність вашого
                  телевізора.
                </li>
                <li>
                  Швидкий та надійний сервіс: Ми розуміємо важливість справного
                  телевізора, і наша присвячена команда прагне забезпечити
                  швидкий та надійний ремонт.
                </li>
              </ol>
              <Styled.SubTitle>
                Типові проблеми з телевізорами Xiaomi, які ми вирішуємо:
              </Styled.SubTitle>
              <ol>
                <li>
                  Проблеми з підключенням: Якщо ваш телевізор Xiaomi має
                  проблеми з Wi-Fi або виникають труднощі з підключенням до
                  інших пристроїв, ми можемо вирішити проблеми зв'язку.
                </li>
                <li>
                  Проблеми з материнською платою: Якщо ваш телевізор має
                  проблеми з програмним забезпеченням або пов'язані з
                  материнською платою, наші кваліфіковані техніки можуть їх
                  вирішити.
                </li>
                <li>
                  Заміна екрана: У разі пошкодження або несправності екрану, ми
                  маємо досвід заміни його оригінальним екраном Xiaomi.
                </li>
                <li>
                  Проблеми з аудіо: Якщо ваш телевізор Xiaomi має проблеми із
                  звуком, такі як відсутність звуку або погана якість звуку, ми
                  можемо виявити та відремонтувати аудіо-систему.
                </li>
              </ol>
              <Styled.SubTitle>
                Наш процес ремонту телевізорів Xiaomi:
              </Styled.SubTitle>
              <ol>
                <li>
                  Комплексний огляд: Наші техніки проводять детальний огляд, щоб
                  виявити причину проблеми.
                </li>
                <li>
                  Детальна оцінка: Після діагностики ми надаємо докладну оцінку
                  вартості ремонту.
                </li>
                <li>
                  Кваліфікований ремонт: З використанням оригінальних запчастин
                  Xiaomi ми приступаємо до ремонту для забезпечення оптимальної
                  продуктивності.
                </li>
                <li>
                  Тривале тестування: Перед поверненням вашого телевізора ми
                  тщательно тестируємо його, щоб переконатися в його бездоганній
                  роботі.
                </li>
                <li>
                  Гарантія: Ми гарантуємо якість нашого ремонту і надаємо
                  гарантію на використані запчастини та роботу.
                </li>
              </ol>
              <Styled.SubTitle>Висновок:</Styled.SubTitle>
              <p>
                Не дозволяйте проблемам з телевізором перешкоджати вашому
                розвагові. Довіртеся нашим професійним послугам з ремонту
                телевізорів Phanasonic, щоб оживити ваш телевізор. Зв'яжіться з
                нами сьогодні, щоб назначити ремонт і переконатися в надійності,
                ефективності та якості наших послуг з ремонту телевізорів.
              </p>
            </Styled.Page>
          )}
        </Container>
      </Section>
    </Layout>
  );
}
